import type { MetaFunction, ActionFunctionArgs } from "@remix-run/node";
import Navigation from "~/components/Navigation";
import Markdown from 'react-markdown'

export const meta: MetaFunction = () => {
    return [
        { title: "IT BOOST" },
        { name: "description", content: "Захоплююча онлайн-школа, де діти віком від 8 до 14 років отримують потужний старт у світі інформаційних технологій." },
        { name: "keywords", content: "IT,Python,діти,розробка,ігри,дизайн,програмування,Україна,школа,навчання,дистанційно,дешево,безпечно,курси,створення ігор" },
    ];
};

const content = `
# ДОГОВІР НА НАДАННЯ ПОСЛУГ З НАВЧАННЯ ДИЗАЙНУ ТА ПРОГРАМУВАННЮ ДІТЕЙ

м. Миколаїв Редакція від  

«01» жовтня 2024 року  
  
Договір, розміщений на цьому сайті - це публічна оферта, що містить умови надання послуг з навчання дизайну і програмування в режимі онлайн закладу «ITBoost», до якого приєднується Замовник/Студент.  
  
## 1. ЗАГАЛЬНІ ПОЛОЖЕННЯ  
  
1.1. Основні поняття та визначення термінів, що вживаються в Договорі:  
  
1.1.1. Акцепт (прийняття пропозицій) — повне й безумовне прийняття Замовником умов, викладених в цьому Договорі шляхом попередньої оплати 100% вартості обраної послуги та вчинення з боку Замовника будь-якої дії, спрямованої на прийняття пропозиції укласти цей Договір або фактичне користування послугами за цим Договором.  
  
1.1.2. Виконавець — Фізична особа-підприємець Січкарюк Тетяна Василівна (код отримувача: 2885409868), що діє під брендом "ITBoost", здійснює діяльність з надання послуг з навчання дизайну і програмуванню на дистанційних онлайн-курсах.  
  
1.1.3. Договір — є правочинним у розумінні ст. 626 Цивільного кодексу України, який регулює взаємні відносини між Замовником та Виконавцем у процесі надання останнім послуг з навчання дизайну і програмуванню.  
  
1.1.4. Замовник — фізична особа, що досягла 18-річного віку, яка має повну цивільну дієздатність, яка є батьком, матір'ю, законним опікуном (представником) або інша фізична особа, що представляє інтереси Студента, відповідно до чинного законодавства України, який буде отримувати Послуги.  
  
1.1.5. Інтернет-сторінка — офіційна веб-сторінка Виконавця в мережі Інтернет, яка знаходиться за адресою:  [https://www.itboost.online](https://www.itboost.online) та є джерелом інформування Замовника/Студента (далі - «Сайт»).  
  
1.1.6. Послуга — Послуга у сфері навчання дизайну та програмуванню, що полягає в наданні дистанційних інформаційно-консультаційних занять (в режимі реального часу чи з наданням записів) та інших послуг у сфері дизайну і програмування.  
  
1.1.7. Публічна оферта (пропозиція) — пропозиція Виконавця (викладена на його інтернет-сторінці [https://www.itboost.online](https://www.itboost.online)), адресована необмеженому колу осіб згідно з ст. 641 Цивільного кодексу України, укласти з ним договір на умовах, визначених у ній.  
  
1.1.8. Студент — дитина віком з 9 до 14 років, що отримує Послугу від закладу «ITBoost» в порядку і на умовах цього Договору.  
  
1.2. Цей договір укладається шляхом надання повної і безумовної згоди (акцепту) Замовника на укладення Договору в повному обсязі, без підписання письмового примірника Договору Сторонами.  
  
1.3. Акцептуванням цього Договору Замовник підтверджує факт ознайомлення, згоди та прийняття усіх умов цього Договору.  
  
## 2. ПРЕДМЕТ ДОГОВОРУ  
  
2.1. Виконавець пропонує та зобов’язується після акцептування цього Договору надати Замовнику Послуги із навчання дизайну і програмуванню на дистанційних заняттях в режимі онлайн відповідно до обраного Замовником навчального курсу і пакету Послуг.  
  
2.2. Послуги за цим Договором надаються Студентові, викладачами Виконавця, шляхом проведення онлайн-занять в режимі реального часу або направлення відеозапису заняття, за обраним Замовником пакетом Послуг, в порядку та на умовах, визначених цим Договором.  
  
2.3. Замовнику після акцептування Договору надається доступ до онлайн-платформи та/або сервісу, на який протягом всієї тривалості курсу, будуть проводитись дистанційні онлайн-заняття та/або розміщуватись навчальні чи інформаційні матеріали (відеозаписи занять, текстові завдання тощо).  
  
2.4. Договір вважається укладеним з моменту отримання Виконавцем повної попередньої оплати 100% вартості обраної послуги та діє до повного виконання сторонами своїх зобов’язань або до розірвання Договору однією із Сторін.  
  
## 3. ВАРТІСТЬ ПОСЛУГ ТА ПОРЯДОК РОЗРАХУНКІВ  
  
3.1. Послуги надаються Замовникові на основі цін та тарифів, заявлених на Сайті. Вартість Послуги розраховується в залежності від обраної Замовником кількості занять — пакету Послуги.  
  
3.2. Оплата за надання Послуг здійснюється шляхом перерахування грошових коштів у спосіб, який вказується в СМС-повідомленні, що надсилається Замовнику після заповнення Заявки-анкети.  
  
3.3. Вартість послуг не включає комісію банків/платіжних систем, що стягується під час здійснення платежу.  
  
3.4. Виконавець має право в односторонньому порядку змінювати вартість Послуг в залежності від кон’юнктури ринку.  
  
3.5. Виконавець не може змінювати вартість послуг для конкретного Замовника у випадку, якщо той вже прийняв умови Виконавця та здійснив оплату за замовлений пакет Послуг, у встановленому цим Договором порядку.  
  
3.6. Послуги надаються Замовнику виключно на попередній платній основі шляхом оплати в повному обсязі на відповідну кількість занять до дня початку відвідування занять Студентом.  
  
3.7. Послуга вважається сплаченою з моменту зарахування коштів на поточний рахунок Виконавця.  
  
3.8. Кошти, сплачені Замовником у відповідності до п. 3.1 ст. 3 цього Договору, поверненню не підлягають. Винятком з цього правила може бути лише умова п. 5.2.4 ст. 5 цього Договору.  
  
## 4. УМОВИ НАДАННЯ ПОСЛУГ  
  
4.1. Замовник має право оформити замовлення на будь-який пакет Послуг, представлений на Сайті шляхом заповнення заяви-анкети.  
  
4.2. Пакет послуг складається з 24, 48, 72 або 96 занять що проводяться за обраним Замовником курсом відповідно до навчальної програми.  
  
4.3. Курс, в залежності від обраної навчальної програми, розрахований на проведення онлайн-занять у кількості, що може перевищувати 48 занять. Вся інформація про курси, навчальні програми, їх опис, терміни та строки, необхідна кількість занять тощо, розміщуються на Сайті.  
  
4.4. У разі неможливості проведення Виконавцем онлайн-занять у раніше визначені терміни, Виконавець має право перенести терміни їх проведення завчасно повідомивши про це Замовника шляхом здійснення сервісного дзвінка та/або оповіщенням через Telegram, Viber чи СМС повідомленням за контактними номерами телефону Замовника.  
  
4.5. У разі, якщо Студент з будь-яких причин не брав участі в онлайн-занятті, Виконавець надає доступ до відеозапису пропущеного онлайн-заняття шляхом розміщення відеозапису пропущеного заняття на онлайн-майданчик та/або онлайн-сервіс.  
  
4.6. Послуги за цим Договором вважаються наданими Виконавцем з моменту закінчення онлайн-заняття (незалежно від того чи приймав в ньому участь Студент) або надання доступу Виконавцем до відеозапису онлайн-заняття з моменту реалізації технічної можливості доступу до записів та/або матеріалів (незалежно від того чи користувався ними Замовник/Студент).  
  
4.7. Використання Замовником отриманих інформації і матеріалів (аудіо-, відеозаписів і т.д.) допускається тільки в особистих цілях і для особистого використання.  
  
## 5. ПРАВА ТА ОБОВ’ЯЗКИ СТОРІН  
  
5.1. Виконавець зобов’язаний:  
  
5.1.1. ознайомити Замовника/Студента з програмою, тривалістю онлайн-занять та іншою інформацією щодо надання Послуг;  
  
5.1.2. організувати діяльність з навчання Студента відповідно до її віку, індивідуальних особливостей, змісту навчальної програми закладу «ITBoost»;  
  
5.1.3. зберігати місце за Студентом, за умовою оплати за Послуги згідно Тарифів, під час тимчасової відсутності такого Студента;  
  
5.1.4. навчати Студента за програмою закладу «ITBoost» із залученням кваліфікованих спеціалістів;  
  
5.1.5. використовувати при навчанні сучасні технології й додаткові спеціальні програми.  
  
5.2. Виконавець має право:  
  
5.2.1. залишати за собою право здійснювати заміну викладачів та коригувати розклад занять;  
  
5.2.2. не допускати до онлайн-занять в режимі реального часу або до записів цих занять, та/або не надавати Замовнику доступу до навчальних та інформаційних онлайн-матеріалів у разі відсутності повної 100% оплати обраної Замовником послуги;  
  
5.2.3. відрахувати Студента та припинити надання послуги при невиконанні Замовником/Студентом своїх зобов’язань та або у випадку, якщо під час надання Послуг Студент зриває навчання, порушує дисципліну, заважає іншим дітям та викладачам;  
  
5.2.4. на власний розсуд відмовити Клієнту в укладенні Договору або ініціювати припинення надання Послуг. У такому разі Виконавець повідомляє Замовника про припинення надання Послуг, та у разі розірвання Договору Виконавець здійснює відшкодування грошових коштів, сплачених у відповідності до п. 3.1 Договору, за вирахуванням вартості фактично наданих послуг.  
  
5.3. Замовник/Студент зобов’язаний:  
  
5.3.1. Замовник/Студент зобов’язані дотримуватись вимог Договору;  
  
5.3.2. завчасно та у повному обсязі сплачувати вартість Послуг, обраних Замовником;  
  
5.3.3. дотримуватись навчальної дисципліни під час занять.  
  
5.4. Замовник/Студент має право:  
  
5.4.1. вимагати належного ставлення та поваги до себе з боку представників Виконавця;  
  
5.4.2. замовляти додаткові Послуги та користуватися іншими правами відповідно до умов Договору (додаткові Послуги підлягають додатковій оплаті);  
  
5.4.3. вимагати від Виконавця виконання його обов’язків за Договором;  
  
5.4.4. отримувати будь-яку інформацію щодо діяльності Виконавця, яка не вважається Виконавцем конфіденційною;  
  
5.4.5. на досудове та максимально повне врегулювання спірних питань, які можуть виникнути під час виконання Договору, і вживання всіх можливих досудових заходів для вирішення порушених питань;  
  
5.4.6. під час споживання Послуг користуватися допомогою кваліфікованих фахівців, які залучені Виконавцем до надання Послуг;  
  
5.4.7. за погодженням з Виконавцем збільшувати обсяг Послуг. У такому разі Замовник зобов’язаний здійснити відповідну доплату;  
  
5.4.8. отримувати інформацію щодо Послуг Виконавця;  
  
5.4.9. на підтримку своїх законних інтересів та правомірних вимог.  
  
## 6. ЗМІНА І РОЗІРВАННЯ ДОГОВОРУ  
  
6.1. Умови Договору можуть бути зміненими Виконавцем в односторонньому порядку шляхом розміщення Договору в новій редакції на Сайті. Зміни до Договору набувають чинності з наступного дня з дати оприлюднення інформації про ці зміни на Сайті.  
  
6.2. Будь-які зміни Договору з моменту набрання ним чинності поширюються на всіх Замовників послуг, які приєдналися до Договору, у тому числі на тих, хто приєднався до Договору раніше дати набрання чинності змін до Договору. Виконавець не несе будь-якої відповідальності у випадку, коли інформація про зміну Договору, що оприлюднена в порядку, установленому цим Договором, не була отримана та/або вивчена та/або правильно зрозуміла Замовником послуг.  
  
6.3. Цей Договір не може бути розірваний в односторонньому порядку, окрім випадків, визначених у п. 5.2.3 та п. 5.2.4 ст. 5 цього Договору.  
  
6.4. У разі дострокового припинення цього Договору з ініціативи Виконавця на підставах, вказаних у п. 5.2.3 ст. 5 цього Договору, вважається, що Замовник/Студент отримав Послуги, а Виконавець вважається таким, що надав їх належним чином та в повному обсязі.  
  
6.5. У разі односторонньої відмови або дострокового припинення цього Договору з ініціативи Замовника кошти, сплачені Замовником, поверненню не підлягають, крім випадків, передбачених п 5.2.4 ст. 5 цього Договору.  
  
## 7. ВИРІШЕННЯ СУПЕРЕЧОК  
  
7.1. Всі суперечки і розбіжності, що виникли або могли виникнути з приводу невідповідного виконання вимог Договору, підлягають вирішенню шляхом переговорів на підставі звернення однієї із Сторін до іншої.  
  
7.2. Виконавець після отримання від Замовника претензії, зобов’язаний протягом 10 (десяти) днів її розглянути та направити Замовнику мотивовану відповідь.  
  
7.3. У разі неможливості вирішення спорів шляхом переговорів, такі спори підлягають розгляду і вирішенню в судах України відповідно до матеріального і процесуального права України.  
  
## 8. ІНШІ УМОВИ  
  
8.1. Сторони, відповідно до Закону України «Про захист персональних даних», одночасно з підписанням Договору надають інформований дозвіл (інформовану згоду) одна одній на збір, обробку, використання, в тому числі передачу третім особам їх персональних даних і персональних даних фізичних осіб — співробітників та/або представників Сторін (які передаються Стороною іншій Стороні, з метою ідентифікації фізичних осіб, які уповноважені діяти від імені Сторони) та підтверджують, що ними отримані повідомлення про включення переданих Стороною персональних даних до баз персональних даних іншої Сторони Договору з метою реалізації цивільно-правових, господарських та інших відносин виключно в межах, в обсязі та з метою, необхідними для належного виконання умов Договору та законодавства України.  
  
8.2. Сторона, яка порушила зобов’язання, звільняється від відповідальності за порушення зобов’язання, якщо вона доведе, що це порушення сталося внаслідок випадку або непереборної сили. Про настання факту випадку або непереборної сили Виконавець сповіщає Замовника через офіційний сайт закладу «ITBoost», або через СМС розсилки.  
  
Під випадком або непереборною силою слід розуміти обставини, що об'єктивно унеможливлюють виконання зобов’язань, передбачених умовами Договору. Строк виконання зобов’язань за Договором може відкладатися на строк дії форс-мажорних обставин.  
  
Надавач послуг:  
Найменування отримувача: **ФОП Січкарюк Тетяна Василівна** 
Код отримувача: **2885409868** 
Рахунок отримувача у форматі відповідно до стандарту IBAN: **UA933052990000026009031711986**   
Назва банку: **АТ КБ «ПриватБанк»**

Діє під брендом "ITBoost"
`

export default function LegalPage(){
    return (
        <div className="flex flex-col">

            <div>
                <Navigation tabs={false}/>
            </div>

            <div className="grid grid-cols-4 lg:grid-cols-8 py-20">
                <div className=" col-span-4 lg:col-span-3 lg:col-start-3 flex flex-col gap-4 bard">
                    <Markdown>{content}</Markdown>
                </div>
            </div>

        </div>
    )
}